load-test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:3000
  phases:
    - duration: 20
      # 最初に1秒あたり1リクエストから始めて
      arrivalRate: 1
      # そこからduration time (20秒)かけて1秒あたり5リクエストまで増やす
      rampTo: 5
      name: Warm up phase
    - duration: 20
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 10
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://artillery.io/docs/reference/extensions
  plugins:
    ensure:
      thresholds:
        # 99%のリクエストが何ms以内に完了すれば合格とするか閾値を決める
        # 例えばリクエストを100回送ったときにレスポンスの速度が速い順で並べて99番目の値が2000ms以内であれば合格
        - http.response_time.p99: 3000
        # 95%のリクエストが何ms以内に完了すれば合格とするか閾値を決める
        - http.response_time.p95: 2500
    apdex:
      threshold: 1000
    metrics-by-endpoint: {}
scenarios:
  - flow:
      - loop:
          # 各URLに対して順番にアクセス
          - get:
              url: '/ja'
          - get:
              url: '/en'
        # 何回ループするか
        count: 1