load-test.yml
config:
  target: http://localhost:3000
  http:
    followRedirects: true
    timeout: 10000
    headers:
      Accept: "text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8"
      Accept-Language: "ja,en;q=0.8"
      User-Agent: "Mozilla/5.0"
      X-Test-Run: "artillery-local"   # ← 後でDatadogで絞り込む用

  phases:
    # 1) ふつうの利用（緩やかに上げる）
    - duration: 10
      arrivalRate: 0.5
      rampTo: 0.5   
      name: Normal ramp

scenarios:
  - name: browse-ja-en
    flow:
      - get:
          url: "/en/test"
          headers:
            X-Req-Id: {{ $randomString() }}
      - think: 2